<?php

namespace Database\Seeders;

use App\Models\Affiliate;
use App\Models\Forestry;
use Illuminate\Database\Seeder;

class AffiliateSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $affiliates = [
            [
                'title' => 'Колківська',
                'code' => 'kolkivska',
                'forestry' => [
                    'Граддя',
                    'Колки',
                    'Осницьке',
                    'Рудниківське',
                    'Тельчівське',
                    'Куклинське',
                    'Чарторийське',
                    'Розничівське',
                    'Куликовицьке',
                ]
            ],
            [
                'title' => 'Ратнівська',
                'code' => 'ratnivska',
                'forestry' => [
                    'Ратнівське',
                    'Гірниківське',
                    'Кортеліське',
                    'Турське',
                    'Жиричівське',
                    'Заболоттівське',
                    'Щедрогірське',
                    'Поступельське',
                    'Заболоттівське  №2',
                ]
            ],
            [
                'title' => 'Любомльська',
                'code' => 'liubomlska',
                'forestry' => [
                    'Любомльське',
                    'Мосирське',
                    'Чорноплеське',
                    'Головнянське',
                    'Забузьке',
                    'Гупалівське',
                    'Гущанське',
                    'Куснищанське',
                    'Крушинецьке',
                    'Шацьке',
                    'Поліське',
                    'Піщанське',
                    'Ростанське',
                    'Замлинське',
                ]
            ],
            [
                'title' => 'Володимир-Волинська',
                'code' => 'volodymyr_volynska',
                'forestry' => [
                    'Берестечівське',
                    'Горохівське',
                    'Губинське',
                    'Ішівське',
                    'Коритницьке',
                    'Локачинське',
                    'Микуличівське',
                    'Мокрецьке',
                    'Ново-Зборишівське',
                    'Осівське',
                    'Павлівське',
                    'Перевалівське',
                    'Ружинське',
                    'Стенжаричівське',
                    'Устилузьке',

                ]
            ],
            [
                'title' => 'Ківерцівська',
                'code' => 'kivertsivska',
                'forestry' => [
                    'Ківерцівське',
                    'Муравищенське',
                    'Сокиричівське',
                    'Рожищенське',
                    'Торчинське',
                    'Мощаницьке',
                    'Звірівське',
                    'Берестянське',
                    'Горинське',
                    'Партизанське',
                    'Цуманське',

                ]
            ],
            [
                'title' => 'Ковельська',
                'code' => 'kovelska',
                'forestry' => [
                    'Білинське',
                    'Буцинське',
                    'Дубечнівське',
                    'Замшанське',
                    'Кашівське',
                    'Ковельське',
                    'Любохинівське',
                    'Радовичівське',
                    'Скулинське',
                    'Старовижівське',
                    'Сьомаківське',
                    'Углівське',
                ]
            ],
            [
                'title' => 'Камінь-Каширська',
                'code' => 'kamin_kashyrska',
                'forestry' => [
                    'Велико-Обзирське',
                    'Видертське',
                    'Добренське',
                    'Карпилівське',
                    'Клітицьке',
                    'Нуйнівське',
                    'Пнівненське',
                    'Бузаківське',
                    'Сошичненське',
                    'Боровненське',
                    'Кримнівське',
                    'Полицівське',
                    'Тоболівське',
                ]
            ],
            [
                'title' => 'Любешівська',
                'code' => 'liubeshivska',
                'forestry' => [
                    'Великоглушанське',
                    'Деревківське',
                    'Дольське',
                    'Залізницьке',
                    'Гірківське',
                ]
            ],
            [
                'title' => 'Городоцька',
                'code' => 'horodotska',
                'forestry' => [
                    'Лишнівське',
                    'Городоцьке',
                    'Троянівське',
                    'Градиське',
                    'Новорудське',
                    'Борове',
                ]
            ],
            [
                'title' => 'Дубенська',
                'code' => 'dubenska',
                'forestry' => [
                    'Білогородське',
                    'Бущанське',
                    'Верхівське',
                    'Вовковиївське',
                    'Гощанське',
                    'Дублянське',
                    'Крупецьке',
                    'Майданське',
                    'Мартинівське',
                    'Мирогощанське',
                    'Млинівське',
                    'Мостівське',
                    'Новомалинське',
                    'Острожецьке',
                    'Радивилівське',
                    'Сестрятинське',
                    'Смизьке',
                    'Соснівське',
                    'Хорівське'

                ]
            ],
            [
                'title' => 'Маневицька',
                'code' => 'manevytska',
                'forestry' => [
                    'Маневицьке',
                    'Черевахівське',
                    'Вовчецьке',
                    'Галузійське'
                ]
            ],
            [
                'title' => 'Висоцька',
                'code' => 'vysotska'
            ],
            [
                'title' => 'Рафалівська',
                'code' => 'rafalivska',
                'forestry' => [
                    'Антонівське',
                    'Біленське',
                    'Володимирецьке',
                    'Воронківське',
                    'Красносільське',
                    'Любахівське',
                    'Мульчицьке',
                    'Озерецьке',
                    'Полицьке',
                    'Рафалівське',
                    'Сопачівське',
                    'Собіщицьке',
                    'Степангородське',
                    'Телковицьке',
                    'Хиноцьке',
                    'Цепцевицьке',
                ]
            ],
            [
                'title' => 'Костопільська',
                'code' => 'kostopilska',
                'forestry' => [
                    'Костопільське',
                    'Мащанське',
                    'Мидське',
                    'Стидинське',
                    'Злазненське',
                    'Базальтівське',
                    'Моквинське',
                    'Суське',
                    'Сморжівське',
                    'Решуцьке',
                    'Олександрійське',
                    'Новоставське',
                    'Любомирське',
                    'Корчинське',
                    'Корецьке',
                    'Клеванське',
                    'Здолбунівське',
                    'Деражненське',
                ]
            ],
            [
                'title' => 'Соснівська',
                'code' => 'sosnivska',
                'forestry' => [
                    'Жовтневе'
                ]
            ],
            [
                'title' => 'Березнівська',
                'code' => 'bereznivska',
                'forestry' => [
                    'Балашівське',
                    'Березнівське',
                    'Бобрівське',
                    'Князівське',
                    'Малинське',
                    'Малуське',
                    'Кузьмівське',
                    'Степанське',
                ]
            ],
            [
                'title' => 'Сарненська',
                'code' => 'sarnenska'
            ],
            [
                'title' => 'Клесівська',
                'code' => 'klesivska'
            ],
            [
                'title' => 'Рожитнівська',
                'code' => 'rozhytnivska'
            ],
        ];

        foreach ($affiliates as $a) {
            $affiliate = Affiliate::create([
                'title' => $a['title'],
                'code' => $a['code']
            ]);
            if (array_key_exists('forestry', $a)) {
                foreach ($a['forestry'] as $f) {
                    Forestry::create([
                        'title' => $f,
                        'affiliate_id' => $affiliate->id
                    ]);
                }
            }
        }
    }

}
